p-podsiadly/llvm-stm8/llvm/lib/Target/STM8/MCTargetDesc/STM8MCCodeEmitter.cpp
#include "STM8MCCodeEmitter.h"
#include "STM8FixupKinds.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCFixup.h"
#include "llvm/MC/MCInst.h"
#include "llvm/MC/MCInstrInfo.h"
#include "llvm/MC/MCRegisterInfo.h"

#define GET_INSTRINFO_ENUM
#define GET_INSTRINFO_OPERAND_TYPES_ENUM
#include "STM8GenInstrInfo.inc"

namespace llvm {

#define GET_OPERAND_BIT_OFFSET
#include "STM8GenMCCodeEmitter.inc"

STM8MCCodeEmitter::STM8MCCodeEmitter(const MCInstrInfo &InstrInfo,
                                     MCContext &Ctx)
    : InstrInfo(InstrInfo), Ctx(Ctx) {}

void STM8MCCodeEmitter::encodeInstruction(const MCInst &MI,
                                          SmallVectorImpl<char> &CB,
                                          SmallVectorImpl<MCFixup> &Fixups,
                                          const MCSubtargetInfo &STI) const {
  const MCInstrDesc &Desc = InstrInfo.get(MI.getOpcode());

  // Get byte count of instruction
  unsigned Size = Desc.getSize();
  if (Size == 0) {
    Ctx.reportError(MI.getLoc(), Twine("Cannot encode ") +
                                     InstrInfo.getName(MI.getOpcode()) +
                                     ": size is 0");
    return;
  }

  uint64_t BinaryOpCode = getBinaryCodeForInstr(MI, Fixups, STI);

  for (int i = Size - 1; i >= 0; --i) {
    uint8_t octet = (BinaryOpCode >> (i * 8)) & 0xFF;
    CB.push_back(static_cast<char>(octet));
  }
}

uint64_t
STM8MCCodeEmitter::getMachineOpValue(const MCInst &MI, const MCOperand &MO,
                                     SmallVectorImpl<MCFixup> &Fixups,
                                     const MCSubtargetInfo &STI) const {
  if (MO.isReg()) {
    return Ctx.getRegisterInfo()->getEncodingValue(MO.getReg());
  }

  llvm_unreachable("Unexpected MCOperand type");
}

uint64_t STM8MCCodeEmitter::encodeImm8(const MCInst &MI, unsigned OpIdx,
                                       SmallVectorImpl<MCFixup> &Fixups,
                                       const MCSubtargetInfo &STI) const {
  return encodeImmWithPossibleFixup(MI, OpIdx, Fixups, STI, STM8::fixup_8, 8);
}

uint64_t STM8MCCodeEmitter::encodeImm16(const MCInst &MI, unsigned OpIdx,
                                        SmallVectorImpl<MCFixup> &Fixups,
                                        const MCSubtargetInfo &STI) const {
  return encodeImmWithPossibleFixup(MI, OpIdx, Fixups, STI, STM8::fixup_16, 16);
}

uint64_t STM8MCCodeEmitter::encodeDirectMem(const MCInst &MI, unsigned OpIdx,
                                            SmallVectorImpl<MCFixup> &Fixups,
                                            const MCSubtargetInfo &STI) const {
  return encodeImmWithPossibleFixup(MI, OpIdx, Fixups, STI, STM8::fixup_16, 16);
}

uint64_t
STM8MCCodeEmitter::encodeIndirectMem(const MCInst &MI, unsigned OpIdx,
                                     SmallVectorImpl<MCFixup> &Fixups,
                                     const MCSubtargetInfo &STI) const {
  return encodeImmWithPossibleFixup(MI, OpIdx, Fixups, STI, STM8::fixup_16, 16);
}

uint64_t STM8MCCodeEmitter::encodePCRelImm(const MCInst &MI, unsigned OpIdx,
                                           SmallVectorImpl<MCFixup> &Fixups,
                                           const MCSubtargetInfo &STI) const {
  // If a fixup is needed, LLVM will compute PC-relative value - but it will be
  // relative to the address of the fixup. STM8 uses offsets relative to
  // the beginning of the next instruction. To account for this, (instr size -
  // 1) is encoded in the instruction and later (during assembly/linking) is
  // read and subtracted from the computed offset. This value serves as an
  // implicit added of an ELF relocation.
  unsigned InstrSize = InstrInfo.get(MI.getOpcode()).getSize();
  unsigned Addend = InstrSize - 1;

  return encodeImmWithPossibleFixup(MI, OpIdx, Fixups, STI, STM8::fixup_8_pcrel,
                                    8, Addend);
}

uint64_t STM8MCCodeEmitter::encodeImmWithPossibleFixup(
    const MCInst &MI, unsigned OpIdx, SmallVectorImpl<MCFixup> &Fixups,
    const MCSubtargetInfo &STI, unsigned FixupKind, unsigned FixupBits,
    unsigned Addend) const {
  const MCOperand &MO = MI.getOperand(OpIdx);

  // There are two options:
  // 1) The operand has a concrete immediate value. In this case we emit it
  //    directly.
  // 2) The operand is not known yet and requires a fixup (for
  //    example, its an address of an external symbol). In this case we create a
  //    fixup for bits inside the encoded instruction and return 0.

  if (MO.isImm()) {
    return static_cast<uint64_t>(MO.getImm());
  } else if (MO.isExpr()) {
    // Size of the encoded instruction, in bits.
    unsigned EncBits = (InstrInfo.get(MI.getOpcode()).getSize() * 8);

    // Offset of the operand from the least significant bit ("from the right").
    // getOperandBitOffset() is autogenerated and assumes that target uses
    // little endian encoding. STM8 uses big endian encoding, that's why for us
    // this is the offset from the end of the instruction to the end of the
    // operand.
    unsigned OpROff = getOperandBitOffset(MI, OpIdx, STI);

    // Correct offset of the operand inside the instruction (from left to
    // right).
    unsigned OffsetBits = EncBits - OpROff - FixupBits;
    assert((OffsetBits % 8) == 0 &&
           "Immediate operands are expected to be byte-aligned");

    Fixups.push_back(MCFixup::create(OffsetBits / 8, MO.getExpr(),
                                     MCFixupKind(FixupKind), MI.getLoc()));

    // Return value which will be encoded in the instruction. This will be
    // either 0 or implicit, relocation-specific, addend.
    return Addend;
  }

  llvm_unreachable("Expected immediate or expression operand");
}

uint64_t STM8MCCodeEmitter::encodeOperandDOI(const MCInst &MI, unsigned OpIdx,
                                             SmallVectorImpl<MCFixup> &Fixups,
                                             const MCSubtargetInfo &STI) const {
  const MCOperand &RegMO = MI.getOperand(OpIdx);
  const MCOperand &OffsetMO = MI.getOperand(OpIdx + 1);

  assert(RegMO.isReg() && "Expected register operand");
  assert(OffsetMO.isImm() && "Expected offset after register operand");

  return OffsetMO.getImm();
}

} // namespace llvm
